{"id":115,"template":7,"pagetitle":"IBM QRadar","longtitle":"IM","content":"<h2 class=\"justifyleft\"><strong>IBM QRadar SIEM<\/strong><\/h2>\r\n<p> <strong>IBM Security QRadar SIEM<\/strong> – система мониторинга и анализа событий информационной безопасности. Позволяет осуществлять централизованный сбор, хранение и обработку событий системных журналов (логов) с различных систем организации. Позволяет осуществлять корреляцию между событиями с разных систем для выявления аномалий и наиболее важных инцидентов безопасности в общей массе событий, что позволяет специалистам организации концентрироваться на наиболее серьезных инцидентах и реагировать на них своевременно.<\/p>\r\n<p> <\/p>\r\n<p><em><strong>Основные функциональные возможности:<\/strong><\/em><\/p>\r\n<p>a)      <strong>Нормализация событий<\/strong> – представление событий в едином формате, вне зависимости от исходного формата событий. Например, syslog сообщения и логи баз данных в интерфейсе системы выглядят одинаково, с одинаковыми ключевыми значениями.<\/p>\r\n<p>b)      <strong>Категоризация<\/strong> – присвоение всем входящим событиям категории. Это позволяет осуществлять поиск событий без привязки к исходному формату, источнику или ключевым словам. Например, категоризация позволяет найти все события неудачных попыток аутентификации на всех системах организации сразу, осуществив поиск по категории Неудачная аутентификация.<\/p>\r\n<p>c)     <strong> Встроенная поддержка большого количества разнородных источников<\/strong> – система позволяет подключать большое количество источников событий, начиная с сетевых устройств и заканчивая корпоративными приложениями (например, Microsoft IIS, Kaspersky Security Center и т.д.).<\/p>\r\n<p>d)     <strong> Поддержка нестандартных источников событий<\/strong> – возможность интеграции неподдерживаемых источников, включая нормализацию и категоризацию событий с подобных источников.<\/p>\r\n<p>e)      <strong>Анализ сетевых потоков до седьмого уровня<\/strong> – система позволяет анализировать сетевой трафик организации вплоть до уровня приложений. Это позволяет осуществлять мониторинг и корреляцию на основе данных, содержащихся, например, в http заголовках. Также система поддерживает идентификацию приложений.<\/p>\r\n<p>f)    <strong>   Анализ сетевых аномалий<\/strong> – система имеет возможность осуществлять статистический анализ сетевого трафика для выявления аномалий (например, отклонения от базовой линии, превышения пороговых значений).<\/p>\r\n<p>g)     <strong> Корреляция<\/strong> – возможность связывания событий с разных источников в единый инцидент.<\/p>\r\n<p>h)     <strong> Встроенная система управления уязвимостями<\/strong> – позволяет осуществлять сканирование систем в организации на наличие уязвимостей и производить инвентаризацию IT активов организации. Поддержка сторонних сканеров уязвимостей.<\/p>\r\n<p>i)       <strong>Встроенная система управления рисками<\/strong> – визуализация сетевой топологии, управление конфигурациями сетевых устройств, анализ доступа к узлам и сегментам сети, моделирование изменения конфигурации сетевых устройств с оценкой влияния на возможность доступа к сетевым ресурсам.<\/p>\r\n<p>j)       <strong>Встроенная система управления активами –<\/strong> учет и автоматическое обнаружение и обновление активов. Составление детального профиля актива, включая информацию о запущенных сервисах, установленном ПО, уязвимостях, пользователях и т.п.<\/p>\r\n<p>k)      <strong>Поддержка MSSP модели внедрения<\/strong> – возможность управления инфраструктурой нескольких организаций в пределах одной системы. Полное разграничение событий разных организаций, возможность независимого администрирования (в том числе отдельные правила корреляции, отдельные пользователи и т.д.)<\/p>\r\n<p>l)       <strong>Возможность обратной связи с источниками<\/strong> – позволяет в качестве реакции на правила корреляции отправлять команды на сторонние системы (зависит от сторонней системы, необходим предварительный анализ).<\/p>\r\n<p>m)   <strong>Ретроспективный анализ<\/strong> – позволяет проверять старые данные на совпадение вновь созданным правилам.  <\/p>\r\n<p> <\/p>\r\n<p><strong>IBM Security QRadar SIEM имеет в своем составе следующие компоненты:<\/strong><\/p>\r\n<ol>\r\n<li><em><strong>Event Collector<\/strong><\/em> – коллектор для сбора событий с источников. Осуществляет первичную обработку полученных событий (парсинг, категоризация) и отправку для анализа и хранения на Event Processor. Данные не хранит.<\/li>\r\n<li><em><strong>QFlow Collector<\/strong><\/em> – коллектор для сбора информации о сетевых потоках. Осуществляет первичную обработку и отправку на Flow Processor. Поддерживает следующие протоколы для передачи статистики о сетевом трафике: NetFlow, JFlow, SFlow, Packeteer. Имеет возможность анализа трафика до уровня приложений (L7) при условии наличия полной копии трафика (SPAN порт). Данные не хранит.<\/li>\r\n<li><em><strong>Event Processor<\/strong><\/em> – осуществляет хранение и анализ полученных событий. Обработка событий на соответствие правилам корреляции также производится на процессорах.<\/li>\r\n<li><em><strong>Flow Processor<\/strong><\/em> - осуществляет хранение и анализ полученных данных о сетевых потоках. Производит анализ полученных данных на предмет соответствия правилам корреляции.<\/li>\r\n<li><em><strong>Console<\/strong><\/em> – единая консоль управления всей системой и визуализации полученных данных. Осуществляет генерацию отчетов, хранит всю информация о инцидентах. Позволяет осуществлять корреляцию между данными, хранящимися на разных процессорах.<\/li>\r\n<li><em><strong>Data Node<\/strong><\/em> – расширение дискового пространства для процессоров (Event Processor, Flow Processor). Автоматически осуществляет распределение нагрузки по хранению событий, увеличивает скорость поиска данных за счет параллельного доступа к данным (данные при поиске считываются одновременно с процессора и Data Node). Возможно подключение нескольких Data Node к одному процессору.<\/li>\r\n<\/ol>\r\n<p> <\/p>","parent":{"id":10,"pagetitle":"Инцидент менеджмент","longtitle":"im","uri":"catalog\/management.html","image":"assets\/img\/catalog\/icons\/warning.svg","items":[{"id":108,"pagetitle":"О направлении","uri":"catalog\/management\/about-im.html","items":[{"id":109,"pagetitle":"IM 1","uri":"catalog\/management\/about-im\/im-1.html"},{"id":110,"pagetitle":"IM 2","uri":"catalog\/management\/about-im\/im-2.html"}]},{"id":114,"pagetitle":"Продукты","uri":"catalog\/management\/products.html","parent_active":true,"items":[{"id":115,"pagetitle":"IBM QRadar","uri":"catalog\/management\/products\/ibm.html"}]}]}}